ExprovipFuel/src/Documents/Фактура/Фактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Фактура</name>
  <registerRecords>AccumulationRegister.ОборотыТоплива</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоставщики</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыКлиенты</registerRecords>
  <attributes>
    <name>ПоследнийНомерПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>флагСчитатьСкидкуОтМестаТранзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсЗаДороги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикДороги</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транзакции</name>
    <attributes>
      <name>ДатаТранзакции</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Карта</name>
      <type>
        <types>CatalogRef.Карточки</types>
      </type>
    </attributes>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Автомобиль</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоТранзакции</name>
      <type>
        <types>CatalogRef.МестаТранзакции</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Надбавка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютнаяЦенаСНадбавкой</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.ФактураШаблон</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВалютаПоставщика</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ФлагНеУчитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПримененнаяСкидка</name>
      <type>
        <types>EnumRef.ВидСкидки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ExprovipFuel/src/InformationRegisters/НомераФактур/НомераФактур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НомераФактур</name>
  <resources>
    <name>НомерФактуры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Фактура</name>
    <type>
      <types>DocumentRef.Фактура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ExprovipFuel/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДороги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИдентификаторыКодовПоставщиков</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий77</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ExprovipFuel/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Клиенты</name>
      <description>Клиенты</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>550</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПочтовыйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьДляВыгрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор77</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКлиент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПоставщик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Активный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинАПИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАПИ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МодульОбмена</name>
    <type>
      <types>EnumRef.МодулиОбмена</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ExprovipFuel/src/Documents/Фактура/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить структуру печати.
// Параметры:
//  ФактураОбъект - ДокументОбъект.Фактура 
// 
// Возвращаемое значение:
//  Структура - Получить структуру печати:
// * Клиенты - Массив из СправочникСсылка.Контрагенты
// * Строки - Массив из См. ШаблонСтруктурыСтроки()
// * Фактура - ДокументСсылка.Фактура
Функция ПолучитьСтруктуруПечати(ФактураОбъект) Экспорт	
	ТаблицаКлиенты = ФактураОбъект.Транзакции.Выгрузить();
	ТаблицаКлиенты.Свернуть("Клиент, ЭтапОплаты");
	
	СтруктураПечати = Новый Структура;
	СтруктураПечати.Вставить("Клиенты", Новый Массив);
	СтруктураПечати.Вставить("Строки", Новый Массив);
	СтруктураПечати.Вставить("Фактура", ФактураОбъект.Ссылка);
	
	Для Каждого СтрокаТаблицы Из ТаблицаКлиенты Цикл
		СтруктураСтроки = Новый Структура("Клиент, ЭтапОплаты, Фактура");
		СтруктураСтроки.Клиент = СтрокаТаблицы.Клиент;
		СтруктураСтроки.ЭтапОплаты = СтрокаТаблицы.ЭтапОплаты;
		СтруктураСтроки.Фактура = ФактураОбъект.Ссылка;
		
		СтруктураПечати.Клиенты.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	Для Каждого СтрокаТЧ Из ФактураОбъект.Транзакции Цикл
		СтруктураСтрокиТранзакция = ШаблонСтруктурыСтроки();
		ЗаполнитьЗначенияСвойств(СтруктураСтрокиТранзакция, СтрокаТЧ);
		СтруктураСтрокиТранзакция.Цена = СтрокаТЧ.ВалютнаяЦенаСНадбавкой;
		
		СтруктураПечати.Строки.Добавить(СтруктураСтрокиТранзакция);
	КонецЦикла;	
	
	Возврат СтруктураПечати;
КонецФункции

// Заполнить таблицу печати.
// 
// Параметры:
//  СтруктураПечати - См. ПолучитьСтруктуруПечати
//  ТаблицаПечати - ТаблицаЗначений
Процедура ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати) Экспорт
	ТаблицаКлиентов = Новый ТаблицаЗначений;
	ТаблицаКлиентов.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаКлиентов.Колонки.Добавить("Фактура", Новый ОписаниеТипов("ДокументСсылка.Фактура"));
	ТаблицаКлиентов.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Для Каждого ЭлементМассива ИЗ СтруктураПечати.Клиенты Цикл
		НоваяСтрока = ТаблицаКлиентов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;		
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаКлиентов", ТаблицаКлиентов);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаКлиентов.Клиент КАК Контрагент,
	|	ТаблицаКлиентов.Фактура КАК Фактура,
	|	ТаблицаКлиентов.ЭтапОплаты КАК ЭтапОплаты
	|ПОМЕСТИТЬ ВТ_ТаблицаКлиентов
	|ИЗ
	|	&ТаблицаКлиентов КАК ТаблицаКлиентов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаКлиентов.Контрагент КАК Контрагент,
	|	ВТ_ТаблицаКлиентов.Фактура КАК Фактура,
	|	ВТ_ТаблицаКлиентов.ЭтапОплаты,
	|	ЕСТЬNULL(НомераФактур.НомерФактуры, 0) КАК НомерФактуры
	|ИЗ
	|	ВТ_ТаблицаКлиентов КАК ВТ_ТаблицаКлиентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераФактур КАК НомераФактур
	|		ПО ВТ_ТаблицаКлиентов.Контрагент = НомераФактур.Контрагент
	|		И ВТ_ТаблицаКлиентов.Фактура = НомераФактур.Фактура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ЭтапОплаты
	|ИТОГИ
	|	МАКСИМУМ(НомерФактуры) КАК НомерФактуры,
	|	МАКСИМУМ(Фактура) КАК Фактура
	|ПО
	|	Контрагент";
	
	ПоследнийНомерПечати = ПолучитьПоследнийНомерПечати();
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		Если ВыборкаКонтрагент.НомерФактуры = 0 Тогда
			ПоследнийНомерПечати = ПоследнийНомерПечати + 1;
			НомерФактуры = ПоследнийНомерПечати;
			СоздатьНомерФактуры(ВыборкаКонтрагент.Контрагент, ВыборкаКонтрагент.Фактура, НомерФактуры);
		Иначе
			НомерФактуры = ВыборкаКонтрагент.НомерФактуры;	
		КонецЕсли;
		ВыборкаДетальныеЗаписи = ВыборкаКонтрагент.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ТаблицаПечати.Добавить();
			НоваяСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
			НоваяСтрока.ЭтапОплаты = ВыборкаДетальныеЗаписи.ЭтапОплаты;
			НоваяСтрока.НомерФактуры = НомерФактуры;
		КонецЦикла;	
	КонецЦикла;		
КонецПроцедуры

// Заполнить таблица данные.
// 
// Параметры:
//  СтруктураПечати - См. ПолучитьСтруктуруПечати
//  ТаблицаДанные - ТаблицаЗначений
Процедура ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные) Экспорт
	Для Каждого ЭлементМассива Из СтруктураПечати.Строки Цикл
		НоваяСтрока = ТаблицаДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассива);
	КонецЦикла;	
КонецПроцедуры

// Структура фактуры клиента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
//  ЭтапОплаты - Число
//  НомерФактуры - Строка
//  ФактураСсылка - ДокументСсылка.Фактура
//  ТаблицаДанные - ТаблицаЗначений
// 
// Возвращаемое значение:
//  Структура - Структура фактуры клиента:
// * ТабличныйДокумент - ТабличныйДокумент - 
// * ИмяФайла - Строка - 
// * НомерФактуры - Строка - 
// * ДатаФактуры - Дата
// * ВалютаФактуры - СправочникСсылка.Валюты
// * СуммаФактуры - Число
Функция СтруктураФактурыКлиента(КонтрагентСсылка, ЭтапОплаты, НомерФактуры, ФактураСсылка, ТаблицаДанные) Экспорт
	ДатаОсновнойФактуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ФактураСсылка, "Дата");
	
	Структура = Новый Структура;
	Структура.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент());
	Структура.Вставить("ИмяФайла", "");
	Структура.Вставить("НомерФактуры", "");
	Структура.Вставить("ДатаФактуры", ДатаОсновнойФактуры);
	Структура.Вставить("ВалютаФактуры", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("СуммаФактуры", 0);
	
	ТаблицаДанныеВременная = ТаблицаДанные;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаДанные", ТаблицаДанныеВременная);
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка); 
	Запрос.УстановитьПараметр("ЭтапОплаты", ЭтапОплаты);
	
	#Область ТекстЗапроса
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДанные.Клиент КАК Клиент,
	|	ТаблицаДанные.Продукт КАК Продукт,
	|	ТаблицаДанные.ЭтапОплаты КАК ЭтапОплаты,
	|	ТаблицаДанные.Количество КАК Количество,
	|	ТаблицаДанные.Сумма КАК Сумма,
	|	ТаблицаДанные.СуммаСкидки КАК СуммаСкидки,
	|	ТаблицаДанные.Итого КАК Итого,
	|	ТаблицаДанные.Валюта КАК Валюта,
	|	ТаблицаДанные.ДатаТранзакции КАК ДатаТранзакции,
	|	ТаблицаДанные.МестоТранзакции КАК МестоТранзакции,
	|	ТаблицаДанные.Карта КАК Карта,
	|	ТаблицаДанные.Автомобиль КАК Автомобиль,
	|	ТаблицаДанные.Цена КАК Цена,
	|	ТаблицаДанные.Скидка КАК Скидка,
	|	ТаблицаДанные.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	&ТаблицаДанные КАК ТаблицаДанные
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Клиент,
	|	Продукт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Клиент КАК Клиент,
	|	ВТ_Данные.Продукт КАК Продукт,
	|	СУММА(ВТ_Данные.Количество) КАК Количество,
	|	СУММА(ВТ_Данные.Сумма) КАК Сумма,
	|	СУММА(ВТ_Данные.СуммаСкидки) КАК СуммаСкидки,
	|	СУММА(ВТ_Данные.Итого) КАК Итого,
	|	Номенклатура.ЭтоДороги КАК ЭтоДороги,
	|	МАКСИМУМ(ВТ_Данные.Валюта) КАК Валюта
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_Данные.Продукт = Номенклатура.Ссылка
	|ГДЕ
	|	ВТ_Данные.Клиент = &Контрагент
	|	И ВТ_Данные.ЭтапОплаты = &ЭтапОплаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Данные.Клиент,
	|	ВТ_Данные.Продукт,
	|	Номенклатура.ЭтоДороги
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиент,
	|	ЭтоДороги,
	|	Продукт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.Клиент КАК Клиент,
	|	ВТ_Данные.Продукт КАК Продукт,
	|	ВТ_Данные.ЭтапОплаты КАК ЭтапОплаты,
	|	ВТ_Данные.Количество КАК Количество,
	|	ВТ_Данные.Сумма КАК Сумма,
	|	ВТ_Данные.СуммаСкидки КАК СуммаСкидки,
	|	ВТ_Данные.Итого КАК Итого,
	|	ВТ_Данные.Валюта КАК Валюта,
	|	ВТ_Данные.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_Данные.МестоТранзакции КАК МестоТранзакции,
	|	ЕСТЬNULL(Номенклатура.ЭтоДороги, ЛОЖЬ) КАК ЭтоДороги,
	|	ВТ_Данные.Карта КАК Карта,
	|	ВТ_Данные.Автомобиль КАК Автомобиль,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Скидка КАК Скидка,
	|	ВТ_Данные.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ПОМЕСТИТЬ ВТ_Детализация
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО ВТ_Данные.Продукт = Номенклатура.Ссылка
	|ГДЕ
	|	ВТ_Данные.Клиент = &Контрагент
	|	И ВТ_Данные.ЭтапОплаты = &ЭтапОплаты
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Клиент,
	|	Продукт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Детализация.Клиент КАК Клиент,
	|	ВТ_Детализация.Продукт КАК Продукт,
	|	ВТ_Детализация.ЭтапОплаты КАК ЭтапОплаты,
	|	ВТ_Детализация.Количество КАК Количество,
	|	ВТ_Детализация.Сумма КАК Сумма,
	|	ВТ_Детализация.СуммаСкидки КАК СуммаСкидки,
	|	ВТ_Детализация.Итого КАК Итого,
	|	ВТ_Детализация.Валюта КАК Валюта,
	|	ВТ_Детализация.ДатаТранзакции КАК ДатаТранзакции,
	|	ВТ_Детализация.МестоТранзакции КАК МестоТранзакции,
	|	ВТ_Детализация.ЭтоДороги КАК ЭтоДороги,
	|	ВТ_Детализация.Карта КАК Карта,
	|	ВТ_Детализация.Автомобиль КАК Автомобиль,
	|	ВТ_Детализация.Цена КАК Цена,
	|	ВТ_Детализация.Скидка КАК Скидка,
	|	ВТ_Детализация.ЦенаСоСкидкой КАК ЦенаСоСкидкой
	|ИЗ
	|	ВТ_Детализация КАК ВТ_Детализация
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Детализация.ЭтоДороги,
	|	ДатаТранзакции
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаСкидки),
	|	СУММА(Итого)
	|ПО
	|	ЭтоДороги";
	#КонецОбласти
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ПечатьФактуры8");
	ОбластьТитул = Макет.ПолучитьОбласть("Титул");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтрокаТитул = Макет.ПолучитьОбласть("СтрокаТитул");
	ОбластьИтогТитул = Макет.ПолучитьОбласть("ИтогТитул");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтог = Макет.ПолучитьОбласть("Итог");
	ОбластШапкаБелтол = Макет.ПолучитьОбласть("ШапкаБелтол");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	МассивРезультататов = Запрос.ВыполнитьПакет();
	
	//@skip-check reading-attribute-from-database
	ДатаДокумента = Формат(ДатаОсновнойФактуры, "ДФ=dd.MM.yyyy;");
	
	СтруктураРеквизитовКлиента = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(КонтрагентСсылка, ДатаОсновнойФактуры);
	ОбластьТитул.Параметры.Заполнить(СтруктураРеквизитовКлиента);
	ОбластьТитул.Параметры.НомерФактуры = НомерФактуры;
	ОбластьТитул.Параметры.ДатаДокумента = ДатаДокумента;
	
	ТабличныйДокумент.Вывести(ОбластьТитул);
	
	Выборка = МассивРезультататов[1].Выбрать();
	ИтогСумма = 0;
	ВалютаФактуры = Справочники.Валюты.ПустаяСсылка();
	Пока Выборка.Следующий() Цикл
		ОбластьСтрокаТитул.Параметры.ВидПродукта = Выборка.Продукт;
		ОбластьСтрокаТитул.Параметры.Количество = Выборка.Количество;
		ОбластьСтрокаТитул.Параметры.Стоимость = Выборка.Сумма;
		ОбластьСтрокаТитул.Параметры.СуммаСкидки = Выборка.СуммаСкидки;
		ОбластьСтрокаТитул.Параметры.Итог = Выборка.Итого;	
		ТабличныйДокумент.Вывести(ОбластьСтрокаТитул);
		
		ИтогСумма = ИтогСумма + Выборка.Итого;
		ВалютаФактуры = Выборка.Валюта;
	КонецЦикла;
	Структура.ВалютаФактуры = ВалютаФактуры;
	
	СрокОплаты = КонецМесяца(ДатаОсновнойФактуры) + 15 * 24 * 60 * 60;  //15 дней нового месяца;
	
	ИтогОкругленный = Окр(ИтогСумма);
	ОбластьИтогТитул.Параметры.ИтогОкругленный = ИтогОкругленный;
	ОбластьИтогТитул.Параметры.ИтогОкругление = Окр(ИтогСумма) - ИтогСумма;
	ОбластьИтогТитул.Параметры.Валюта = ВалютаФактуры;
	ОбластьИтогТитул.Параметры.СуммаФактурыПрописью	= Exprovip.ПрописьЧисла(ИтогОкругленный, ВалютаФактуры);
	ОбластьИтогТитул.Параметры.ДатаСрокОплаты = Формат(СрокОплаты, "ДФ=dd.MM.yyyy");
	ТабличныйДокумент.Вывести(ОбластьИтогТитул);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	ФлагЕстьТопливо = Ложь;
	
	Структура.СуммаФактуры = ИтогОкругленный;
	
	//@skip-check new-color
	ЦветФона = Новый Цвет(82, 198, 222);
	
	ВыборкаДетализация = МассивРезультататов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЭтоДороги");
	Пока ВыборкаДетализация.Следующий() Цикл
		Если ВыборкаДетализация.ЭтоДороги Тогда
			Если ФлагЕстьТопливо Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ОбластШапкаБелтол.Параметры.НазваниеКлиента = СтруктураРеквизитовКлиента.НазваниеКлиента;
			ОбластШапкаБелтол.Параметры.Тариф = СтруктураРеквизитовКлиента.Тариф;
			ОбластШапкаБелтол.Параметры.ДатаДокумента = ДатаДокумента;
			ОбластШапкаБелтол.Параметры.НомерФактуры = НомерФактуры;
			ОбластШапкаБелтол.Параметры.Валюта = ВалютаФактуры;
			ТабличныйДокумент.Вывести(ОбластШапкаБелтол);
		Иначе
			ОбластьШапка.Параметры.НазваниеКлиента = СтруктураРеквизитовКлиента.НазваниеКлиента;
			ОбластьШапка.Параметры.Тариф = СтруктураРеквизитовКлиента.Тариф;
			ОбластьШапка.Параметры.ДатаДокумента = ДатаДокумента;
			ОбластьШапка.Параметры.НомерФактуры = НомерФактуры;
			ОбластьШапка.Параметры.Валюта = ВалютаФактуры;
			ТабличныйДокумент.Вывести(ОбластьШапка);
			ФлагЕстьТопливо = Истина;
		КонецЕсли;
		ВыборкаДетальныеЗаписи = ВыборкаДетализация.Выбрать();
		Счетчик = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Счетчик = Счетчик + 1;
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ОбластьСтрока.Параметры.Скидка = СтрШаблон("%1%%", Формат(ВыборкаДетальныеЗаписи.Скидка, "ЧН=0;"));
			Если ВыборкаДетальныеЗаписи.Количество <> 0 Тогда
				//ОбластьСтрока.Параметры.Цена = Окр(ВыборкаДетальныеЗаписи.Итого / ВыборкаДетальныеЗаписи.Количество, 4);
			КонецЕсли;
			ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьСтрока);
			Если Счетчик % 2 = 0 Тогда
				ТабличныйДокумент.Область(
					ОбластьОформления.Верх,
					1,
					ОбластьОформления.Низ,
					ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;				
			КонецЕсли;			
		КонецЦикла;
		ОбластьИтог.Параметры.ИтогКоличество = ВыборкаДетализация.Количество;
		ОбластьИтог.Параметры.ИтогСумма = ВыборкаДетализация.Сумма;
		ОбластьИтог.Параметры.ИтогСуммаСкидки = ВыборкаДетализация.СуммаСкидки;
		ОбластьИтог.Параметры.ИтогИтого	= ВыборкаДетализация.Итого;
		
		ОбластьОформления = ТабличныйДокумент.Вывести(ОбластьИтог);
		Если Счетчик % 2 <> 0 Тогда
			ТабличныйДокумент.Область(
				ОбластьОформления.Верх,
				1,
				ОбластьОформления.Низ,
				ТабличныйДокумент.ШиринаТаблицы).ЦветФона = ЦветФона;				
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьПодвал);
	КонецЦикла;	
	
	//ТабличныйДокумент.Вывести(ОбластьИтогТитул);
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ПолеСлева = 10;
	ТабличныйДокумент.ПолеСправа = 10;
	ТабличныйДокумент.ПолеСнизу = 10;
	ТабличныйДокумент.ПолеСверху = 15;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ВерхнийКолонтитул.Выводить = Истина;
	ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
	Структура.ТабличныйДокумент = ТабличныйДокумент;
	//@skip-check reading-attribute-from-database
	Структура.ИмяФайла = СтрШаблон("%1_%2", КонтрагентСсылка.Логин, Формат(НомерФактуры, "ЧГ=0;"));		
	Структура.НомерФактуры = НомерФактуры;
	Структура.ДатаФактуры = ДатаОсновнойФактуры;
		
	Возврат Структура;	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Шаблон структуры строки.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры строки:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
Функция ШаблонСтруктурыСтроки()
	Структура = Новый Структура;
	Структура.Вставить("ДатаТранзакции", Дата(1, 1, 1));
	Структура.Вставить("Карта", Справочники.Карточки.ПустаяСсылка());
	Структура.Вставить("Клиент", Справочники.Контрагенты.ПустаяСсылка());
	Структура.Вставить("Автомобиль", "");
	Структура.Вставить("МестоТранзакции", Справочники.МестаТранзакции.ПустаяСсылка());
	Структура.Вставить("Продукт", Справочники.Номенклатура.ПустаяСсылка());
	Структура.Вставить("Количество", 0);
	Структура.Вставить("Цена", 0);
	Структура.Вставить("Сумма", 0);
	Структура.Вставить("Итого", 0);
	Структура.Вставить("СуммаСкидки", 0);
	Структура.Вставить("Скидка", 0);
	Структура.Вставить("ЦенаСоСкидкой", 0);	
	Структура.Вставить("ЭтапОплаты", 0);
	Структура.Вставить("Валюта", Справочники.Валюты.ПустаяСсылка());
	
	Возврат Структура;
КонецФункции

Процедура СоздатьНомерФактуры(Контрагент, Фактура, НомерФактуры)
	МенеджерЗаписи = РегистрыСведений.НомераФактур.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Контрагент = Контрагент;
	МенеджерЗаписи.Фактура = Фактура;
	МенеджерЗаписи.НомерФактуры = НомерФактуры;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Функция ПолучитьПоследнийНомерПечати()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МАКСИМУМ(НомераФактур.НомерФактуры) КАК ПоследнийНомерФактуры
	|ИЗ
	|	РегистрСведений.НомераФактур КАК НомераФактур";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПоследнийНомерФактуры;
	Иначе
		Возврат 0;
	КонецЕсли;		
КонецФункции

#КонецОбласти
#КонецЕсли
